/******************************************************************************
 * @file   silead_impl.c
 * @brief  Contains CA implements.
 *
 *
 * Copyright (c) 2016-2021 GigaDevice/Silead Inc.
 * All rights reserved
 *
 * The present software is the confidential and proprietary information of
 * GigaDevice/Silead Inc. You shall not disclose the present software and
 * shall use it only in accordance with the terms of the license agreement
 * you entered into with GigaDevice/Silead Inc. This software may be
 * subject to export or import laws in certain countries.
 *
 *
 * ------------------- Revision History ------------------------------
 * <author>    <date>   <version>     <desc>
 * David Wang  2018/4/2   0.1.0      Init version
 * David Wang  2018/5/15  0.1.1      Support get finger status
 * John Zhang  2018/5/15  0.1.2      Support load/save config
 * Jack Zhang  2018/5/17  0.1.3      Change test process to simplify app use
 * Rich Li     2018/5/28  0.1.4      Add get enroll number command ID.
 * Davie Wang  2018/6/1   0.1.5      Add capture image sub command ID.
 * David Wang  2018/6/5   0.1.6      Support wakelock & pwdn
 * Rich Li     2018/6/7   0.1.7      Support dump image
 * Jack Zhang  2018/6/15  0.1.8      Add read OTP I/F.
 * Rich Li     2018/7/2   0.1.9      Add algo set param command ID.
 * Ashely Li   2021/1/15  0.2.0      Update copyright notice
 *
 *****************************************************************************/

#define FILE_TAG "silead_impl"
#include "log/logmsg.h"

#include <string.h>
#include <stdlib.h>
#include <fcntl.h>
#include <unistd.h>
#include <errno.h>

#include "silead_const.h"
#include "silead_error.h"
#include "silead_cmd.h"
#include "silead_dev.h"
#include "silead_debug.h"
#include "silead_dump.h"
#include "silead_storage.h"
#include "silead_version.h"
#include "silead_cust.h"
#include "silead_worker.h"
#include "silead_cal.h"
#include "silead_impl.h"
#include "silead_ext.h"
#include "silead_util.h"
#include "silead_ext_skt.h"
#include "silead_bmp.h"
#include "silead_misc.h"

typedef struct fp_ta_feature_bit {
    uint32_t store_normal:1;            // 0x0001, store template in android
    uint32_t tpl_update:1;              // 0x0002, support tpl update after auth success
    uint32_t reinit_after_irq:1;        // 0x0004, need reset after receive irq
    uint32_t need_cal:1;                // 0x0008, need calibrate (capacitive only)
    uint32_t need_cal_finger_up:1;      // 0x0010, need wait finger up (capacitive only)
    uint32_t need_cal2:1;               // 0x0020, need calibrate2 (capacitive only)
    uint32_t finger_loop:1;             // 0x0040, need finger loop to get finger state (capacitive only)
    uint32_t irq_pwdn:1;                // 0x0080, reset down when wait finger down/up (optic only)
    uint32_t irq_pwdn_avdd_down:1;      // 0x0100, avdd down when wait finger down/up (optic only)
    uint32_t is_optic:1;                // 0x0200, optic module
    uint32_t :1;                        // 0x0400, reserved
    uint32_t esd_unsupport:1;           // 0x0800, not support esd (capacitive only)
    uint32_t reset_down_for_flash:1;    // 0x1000, need reset down when operate flash
    uint32_t auth_retry:4;              // 0x2000~10000, auth retry times
    uint32_t watermark:1;               // 0x20000, add watermark on bmp
    uint32_t cal_in_ta:1;               // 0x40000, store cal file in ta
    uint32_t dump_img_mode:1;           // 0x80000, dump img mode(SILEAD RA)
    uint32_t dump_img_encrypt:1;        // 0x100000, dump img encrypt
    uint32_t is_dump_v2:1;              // 0x200000, is dump v2
    uint32_t is_ocp:1;                  // 0x400000, is OCP enabled
} fp_ta_feature_bit_t;

typedef union fp_ta_feature {
    fp_ta_feature_bit_t bit;
    uint32_t feature;
} fp_ta_feature_t;

typedef struct fp_ta_otp_bit {
    uint32_t reserved:14;
    uint32_t year:2;
    uint32_t day:5;
    uint32_t month:4;
    uint32_t ver:3;
    uint32_t vendor_id:4;
    uint32_t reserved32[2];
} fp_ta_otp_bit_t;

typedef union fp_ta_otp {
    fp_ta_otp_bit_t info;
    uint32_t raw[3];
} fp_ta_otp_t;

typedef struct fp_ta_otp_map {
    char    *str;
} fp_ta_otp_map_t;

static const fp_ta_otp_map_t s_otp_vendor[] = {
    {"OFILM\0"},
    {"QTECH\0"},
    {"PRIMAX\0"},
    {"HOLITECH\0"},
    {"HNLENS\0"},
    {"TRULY\0"},
    {"TOPTOUCH\0"},
    {"KIRE\0"},
    {"FINGERCHIP\0"},
    {"HOLITECHINDIA\0"},
    {"FINGERCHIPINDIA\0"},
    {"Unknown\0"},
};

static fp_ta_feature_t m_ta_feature;

static uint32_t m_tpl_max_size = 0;
static uint32_t m_need_finger_loop_bak = 0;

